## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| update   | `module.api_ecs.aws_ecs_service.this`                  |
| recreate | `module.api_ecs.aws_ecs_task_definition.this`          |
| add      | `module.api_ecs.aws_service_discovery_service.this[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "forms-api"
      + task_role_arn        = (known after apply)
    }

  # module.api_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/Forms/forms-api"
        name                               = "forms-api"
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "forms-api:134" -> (known after apply)
        # (16 unchanged attributes hidden)

      + service_registries {
          + container_name = "forms-api"
          + registry_arn   = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.api_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/forms-api:23" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:687401027353:task-definition/forms-api" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "forms-api" -> (known after apply)
      ~ revision                 = 23 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api_ecs.aws_service_discovery_service.this[0] will be created
  + resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "forms-api"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + type          = (known after apply)

      + dns_config {
          + routing_policy = "MULTIVALUE"
            # (1 unchanged attribute hidden)

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + ecs_api_service_port              = "3001"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
